In [371]:
# 5.1 Introduction to pandas Data Structures

In [372]:
In [1]: import numpy as np

In [2]: import pandas as pd

In [373]:
In [3]: from pandas import Series, DataFrame

In [374]:
In [14]: obj = pd.Series([4, 7, -5, 3])

In [375]:
In [15]: obj

0    4
1    7
2   -5
3    3
dtype: int64

In [376]:
In [16]: obj.array

<NumpyExtensionArray>
[np.int64(4), np.int64(7), np.int64(-5), np.int64(3)]
Length: 4, dtype: int64

In [377]:
In [17]: obj.index

RangeIndex(start=0, stop=4, step=1)

In [378]:
In [18]: obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

In [379]:
In [19]: obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [380]:
In [16]: obj.array

<NumpyExtensionArray>
[np.int64(4), np.int64(7), np.int64(-5), np.int64(3)]
Length: 4, dtype: int64

In [381]:
In [17]: obj.index

RangeIndex(start=0, stop=4, step=1)

In [382]:
In [18]: obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

In [383]:
In [19]: obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [384]:
In [20]: obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [385]:
In [21]: obj2["a"]

np.int64(-5)

In [386]:
In [24]: obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [387]:
In [25]: obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [388]:
In [26]: import numpy as np

In [389]:
In [27]: np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [390]:
In [28]: "b" in obj2

True

In [391]:
In [29]: "e" in obj2

False

In [392]:
In [30]: sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [393]:
In [31]: obj3 = pd.Series(sdata)

In [394]:
In [32]: obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [395]:
In [33]: obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [396]:
In [34]: states = ["California", "Ohio", "Oregon", "Texas"]

In [397]:
In [35]: obj4 = pd.Series(sdata, index=states)

In [398]:
In [36]: obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [399]:
In [37]: pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [400]:
In [38]: pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [401]:
In [39]: obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [402]:
In [40]: obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [403]:
In [41]: obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [404]:
In [42]: obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [405]:
In [43]: obj4.name = "population"

In [406]:
In [44]: obj4.index.name = "state"

In [407]:
In [45]: obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [408]:
In [46]: obj

0    4
1    7
2   -5
3    3
dtype: int64

In [409]:
In [47]: obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

In [410]:
In [48]: obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [411]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [412]:
In [50]: frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [413]:
In [51]: frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [414]:
In [52]: frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [415]:
In [53]: pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [416]:
In [54]: frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])

In [417]:
In [55]: frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [418]:
In [56]: frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [419]:
In [57]: frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [420]:
In [58]: frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [421]:
In [59]: frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [422]:
In [60]: frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [423]:
In [61]: frame2["debt"] = 16.5

In [424]:
In [62]: frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [425]:
In [63]: frame2["debt"] = np.arange(6.)

In [426]:
In [64]: frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [427]:
In [65]: val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])

In [428]:
In [66]: frame2["debt"] = val

In [429]:
In [67]: frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [430]:
In [68]: frame2["eastern"] = frame2["state"] == "Ohio"

In [431]:
In [69]: frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

In [432]:
In [70]: del frame2["eastern"]

In [433]:
In [71]: frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [434]:
In [72]: populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
   ....:                "Nevada": {2001: 2.4, 2002: 2.9}}

In [435]:
In [73]: frame3 = pd.DataFrame(populations)

In [436]:
In [74]: frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [437]:
In [75]: frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [438]:
In [76]: pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [439]:
In [77]: pdata = {"Ohio": frame3["Ohio"][:-1],
   ....:          "Nevada": frame3["Nevada"][:2]}

In [440]:
In [78]: pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [441]:
In [79]: frame3.index.name = "year"

In [442]:
In [80]: frame3.columns.name = "state"

In [443]:
In [81]: frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [444]:
In [82]: frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [445]:
In [83]: frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, -1.2],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, -1.5],
       [2003, 'Nevada', 3.2, -1.7]], dtype=object)

In [446]:
In [84]: obj = pd.Series(np.arange(3), index=["a", "b", "c"])

In [447]:
In [85]: index = obj.index

In [448]:
In [86]: index

Index(['a', 'b', 'c'], dtype='object')

In [449]:
In [87]: index[1:]

Index(['b', 'c'], dtype='object')

In [450]:
index[1] = "d"  # TypeError

TypeError: Index does not support mutable operations

In [451]:
In [88]: labels = pd.Index(np.arange(3))

In [452]:
In [89]: labels

Index([0, 1, 2], dtype='int64')

In [453]:
In [90]: obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [454]:
In [91]: obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [455]:
In [92]: obj2.index is labels

True

In [456]:
In [93]: frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [457]:
In [94]: frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [458]:
In [95]: "Ohio" in frame3.columns

True

In [459]:
In [96]: 2003 in frame3.index

False

In [117]:
In [97]: pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [ ]:
# 5.2 Essential Functionality

In [460]:
In [98]: obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])

In [461]:
In [99]: obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [462]:
In [100]: obj2 = obj.reindex(["a", "b", "c", "d", "e"])

In [463]:
In [101]: obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [464]:
In [102]: obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])

In [465]:
In [103]: obj3

0      blue
2    purple
4    yellow
dtype: object

In [466]:
In [104]: obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [467]:
In [105]: frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
   .....:                      index=["a", "c", "d"],
   .....:                      columns=["Ohio", "Texas", "California"])

In [468]:
In [106]: frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [469]:
In [107]: frame2 = frame.reindex(index=["a", "b", "c", "d"])

In [470]:
In [108]: frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [471]:
In [109]: states = ["Texas", "Utah", "California"]

In [472]:
In [110]: frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [473]:
In [111]: frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [474]:
In [112]: frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

In [475]:
In [113]: obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])

In [476]:
In [114]: obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [477]:
In [115]: new_obj = obj.drop("c")

In [478]:
In [116]: new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [479]:
In [117]: obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [480]:
In [118]: data = pd.DataFrame(np.arange(16).reshape((4, 4)),
   .....:                     index=["Ohio", "Colorado", "Utah", "New York"],
   .....:                     columns=["one", "two", "three", "four"])

In [481]:
In [119]: data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [482]:
In [120]: data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [483]:
In [121]: data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [484]:
In [122]: data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [485]:
In [123]: data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [486]:
In [124]: obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])

In [487]:
In [125]: obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [488]:
In [126]: obj["b"]

np.float64(1.0)

In [491]:
In [127]: obj.iloc[1]

np.float64(1.0)

In [492]:
In [128]: obj[2:4]

c    2.0
d    3.0
dtype: float64

In [493]:
In [129]: obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [494]:
In [130]: obj.iloc[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [495]:
In [131]: obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [496]:
In [132]: obj.loc[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [508]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])

obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

obj1

obj2

obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [509]:
In [138]: obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [510]:
In [134]: obj2.iloc[[0, 1]]

a    1
b    2
dtype: int64

In [511]:
In [139]: obj1.iloc[[0, 1, 2]]

In [140]: obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [512]:
In [141]: obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [513]:
In [142]: obj2.loc["b":"c"] = 5

In [514]:
In [143]: obj2

a    1
b    5
c    5
dtype: int64

In [515]:
In [144]: data = pd.DataFrame(np.arange(16).reshape((4, 4)),
   .....:                     index=["Ohio", "Colorado", "Utah", "New York"],
   .....:                     columns=["one", "two", "three", "four"])

In [516]:
In [145]: data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [517]:
In [146]: data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [518]:
In [147]: data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [519]:
In [148]: data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [520]:
In [149]: data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [521]:
In [150]: data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [522]:
In [151]: data[data < 5] = 0

In [523]:
In [152]: data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [524]:
In [153]: data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [525]:
In [154]: data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [526]:
In [155]: data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [527]:
In [156]: data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

In [528]:
In [157]: data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [529]:
In [158]: data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [530]:
In [159]: data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [531]:
In [160]: data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [532]:
In [161]: data.loc[:"Utah", "two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [533]:
In [162]: data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [534]:
In [163]: data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [535]:
In [164]: ser = pd.Series(np.arange(3.))

In [536]:
In [165]: ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [537]:
In [166]: ser.iloc[-1]

np.float64(2.0)

In [190]:
In [167]: ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [191]:
In [168]: ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])

In [538]:
In [169]: ser2.iloc[-1]

np.float64(2.0)

In [539]:
In [170]: ser.iloc[-1]

np.float64(2.0)

In [540]:
In [171]: ser[:2]

0    0.0
1    1.0
dtype: float64

In [541]:
In [172]: data.loc[:, "one"] = 1

In [542]:
In [173]: data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [543]:
In [174]: data.iloc[2] = 5

In [544]:
In [175]: data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [545]:
In [176]: data.loc[data["four"] > 5] = 3

In [546]:
In [177]: data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [547]:
In [179]: data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [548]:
In [180]: data.loc[data.three == 5, "three"] = 6

In [549]:
In [181]: data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

In [550]:
In [182]: s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])

In [551]:
In [183]: s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
   .....:                index=["a", "c", "e", "f", "g"])

In [552]:
In [184]: s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [553]:
In [185]: s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [554]:
In [186]: s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [555]:
In [187]: df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
   .....:                    index=["Ohio", "Texas", "Colorado"])

In [556]:
In [188]: df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
   .....:                    index=["Utah", "Ohio", "Texas", "Oregon"])

In [557]:
In [189]: df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [558]:
In [190]: df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [559]:
In [191]: df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [560]:
In [192]: df1 = pd.DataFrame({"A": [1, 2]})

In [561]:
In [193]: df2 = pd.DataFrame({"B": [3, 4]})

In [562]:
In [194]: df1

   A
0  1
1  2

In [563]:
In [195]: df2

   B
0  3
1  4

In [564]:
In [196]: df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [565]:
In [197]: df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
   .....:                    columns=list("abcd"))

In [566]:
In [198]: df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
   .....:                    columns=list("abcde"))

In [567]:
In [199]: df2.loc[1, "b"] = np.nan

In [568]:
In [200]: df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [569]:
In [201]: df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [570]:
In [202]: df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [571]:
In [203]: df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [572]:
In [204]: 1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [573]:
In [205]: df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [574]:
In [206]: df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [575]:
In [207]: arr = np.arange(12.).reshape((3, 4))

In [576]:
In [208]: arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [577]:
In [209]: arr[0]

array([0., 1., 2., 3.])

In [578]:
In [210]: arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [579]:
In [211]: frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
   .....:                      columns=list("bde"),
   .....:                      index=["Utah", "Ohio", "Texas", "Oregon"])

In [580]:
In [212]: series = frame.iloc[0]

In [581]:
In [213]: frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [582]:
In [214]: series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [583]:
In [215]: frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [584]:
In [216]: series2 = pd.Series(np.arange(3), index=["b", "e", "f"])

In [585]:
In [217]: series2

b    0
e    1
f    2
dtype: int64

In [586]:
In [218]: frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [587]:
In [219]: series3 = frame["d"]

In [588]:
In [220]: frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [589]:
In [221]: series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [590]:
In [222]: frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [591]:
In [223]: frame = pd.DataFrame(np.random.standard_normal((4, 3)),
   .....:                      columns=list("bde"),
   .....:                      index=["Utah", "Ohio", "Texas", "Oregon"])

In [592]:
In [224]: frame

               b         d         e
Utah   -0.100999 -0.586280 -0.414986
Ohio    0.526306  0.270798 -0.601520
Texas   0.140070 -2.085519 -0.250849
Oregon  0.027791 -0.257445 -0.392164

In [593]:
In [225]: np.abs(frame)

               b         d         e
Utah    0.100999  0.586280  0.414986
Ohio    0.526306  0.270798  0.601520
Texas   0.140070  2.085519  0.250849
Oregon  0.027791  0.257445  0.392164

In [594]:
In [226]: def f1(x):
   .....:     return x.max() - x.min()

In [595]:
In [227]: frame.apply(f1)

b    0.627305
d    2.356318
e    0.350671
dtype: float64

In [596]:
In [228]: frame.apply(f1, axis="columns")

Utah      0.485281
Ohio      1.127826
Texas     2.225589
Oregon    0.419955
dtype: float64

In [597]:
In [229]: def f2(x):
   .....:     return pd.Series([x.min(), x.max()], index=["min", "max"])

In [598]:
In [230]: frame.apply(f2)

            b         d         e
min -0.100999 -2.085519 -0.601520
max  0.526306  0.270798 -0.250849

In [253]:
In [231]: def my_format(x):
   .....:     return f"{x:.2f}"

In [599]:
In [232]: frame.map(my_format)

            b      d      e
Utah    -0.10  -0.59  -0.41
Ohio     0.53   0.27  -0.60
Texas    0.14  -2.09  -0.25
Oregon   0.03  -0.26  -0.39

In [600]:
In [233]: frame["e"].map(my_format)

Utah      -0.41
Ohio      -0.60
Texas     -0.25
Oregon    -0.39
Name: e, dtype: object

In [601]:
In [234]: obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])

In [602]:
In [235]: obj

d    0
a    1
b    2
c    3
dtype: int64

In [603]:
In [236]: obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [604]:
In [237]: frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
   .....:                      index=["three", "one"],
   .....:                      columns=["d", "a", "b", "c"])

In [605]:
In [238]: frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [606]:
In [239]: frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [607]:
In [240]: frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [608]:
In [241]: frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [609]:
In [242]: obj = pd.Series([4, 7, -3, 2])

In [610]:
In [243]: obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [611]:
In [244]: obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [612]:
In [245]: obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [613]:
In [246]: obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [614]:
In [247]: frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})

In [615]:
In [248]: frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [616]:
In [249]: frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [617]:
In [250]: frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [618]:
In [251]: obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [619]:
In [252]: obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [620]:
In [253]: obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [621]:
In [254]: obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [622]:
In [255]: frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
   .....:                       "c": [-2, 5, 8, -2.5]})

In [623]:
In [256]: frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [624]:
In [257]: frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [625]:
In [258]: obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])

In [626]:
In [259]: obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [627]:
In [260]: obj.index.is_unique

False

In [628]:
In [261]: obj["a"]

a    0
a    1
dtype: int64

In [629]:
In [262]: obj["c"]

np.int64(4)

In [630]:
In [263]: df = pd.DataFrame(np.random.standard_normal((5, 3)),
   .....:                   index=["a", "a", "b", "b", "c"])

In [631]:
In [264]: df

          0         1         2
a -0.877665 -1.903564  1.429079
a  1.019998 -0.196265  0.641305
b -0.397865 -0.182235  0.148752
b  1.151461  0.532257  0.015855
c  0.725900  0.646921 -0.385026

In [632]:
In [265]: df.loc["b"]

          0         1         2
b -0.397865 -0.182235  0.148752
b  1.151461  0.532257  0.015855

In [633]:
In [266]: df.loc["c"]

0    0.725900
1    0.646921
2   -0.385026
Name: c, dtype: float64

In [634]:
# 5.3 Summarizing and Computing Descriptive Statistics

In [635]:
In [267]: df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
   .....:                    [np.nan, np.nan], [0.75, -1.3]],
   .....:                   index=["a", "b", "c", "d"],
   .....:                   columns=["one", "two"])

In [636]:
In [268]: df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [637]:
In [269]: df.sum()

one    9.25
two   -5.80
dtype: float64

In [638]:
In [270]: df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [639]:
In [271]: df.sum(axis="index", skipna=False)

one   NaN
two   NaN
dtype: float64

In [640]:
In [272]: df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [641]:
In [273]: df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [642]:
In [274]: df.idxmax()

one    b
two    d
dtype: object

In [643]:
In [275]: df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [644]:
In [276]: df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [645]:
In [277]: obj = pd.Series(["a", "a", "b", "c"] * 4)

In [646]:
In [278]: obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [647]:
In [279]: price = pd.read_pickle("examples/yahoo_price.pkl")

In [280]: volume = pd.read_pickle("examples/yahoo_volume.pkl")

In [648]:
In [281]: returns = price.pct_change()

In [282]: returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [649]:
In [283]: returns["MSFT"].corr(returns["IBM"])

np.float64(0.49976361144151155)

In [650]:
In [284]: returns["MSFT"].cov(returns["IBM"])

np.float64(8.870655479703549e-05)

In [651]:
In [285]: returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [652]:
In [286]: returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [653]:
In [287]: returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [654]:
In [288]: returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [655]:
In [289]: obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [656]:
In [290]: uniques = obj.unique()

In [657]:
In [291]: uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [658]:
In [292]: obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [659]:
In [293]: # pd.value_counts(obj.to_numpy(), sort=False)
pd.Series(obj.to_numpy()).value_counts(sort=False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64

In [660]:
In [294]: obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [661]:
In [295]: mask = obj.isin(["b", "c"])

In [662]:
In [296]: mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [663]:
In [297]: obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [664]:
In [298]: to_match = pd.Series(["c", "a", "b", "b", "c", "a"])

In [665]:
In [299]: unique_vals = pd.Series(["c", "b", "a"])

In [666]:
In [300]: indices = pd.Index(unique_vals).get_indexer(to_match)

In [667]:
In [301]: indices

array([0, 2, 1, 1, 0, 2])

In [668]:
In [302]: data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
   .....:                      "Qu2": [2, 3, 1, 2, 3],
   .....:                      "Qu3": [1, 5, 2, 4, 4]})

In [669]:
In [303]: data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [670]:
In [304]: data["Qu1"].value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [671]:
In [305]: # result = data.apply(pd.value_counts).fillna(0)
result = data.apply(lambda x: x.value_counts()).fillna(0)

In [672]:
In [306]: result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [673]:
In [307]: data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})

In [674]:
In [308]: data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [675]:
In [309]: data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64